Revit 2027 API
Stone.StoneApplication Property
 The property labeled "Finish" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StoneApplication { get; }
Public Shared ReadOnly Property StoneApplication As String
	Get
public:
static property String^ StoneApplication {
	String^ get ();
}
static member StoneApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneApplicationType".
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace